load-test-results/2025-6-08_test_4/20250608_195209_baseline_fast_medium.txt
Running 1m test @ http://localhost:8080/fast
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.30ms   14.75ms  55.29ms   81.92%
    Req/Sec     7.65k   594.20    14.92k    76.60%
  1828109 requests in 1.00m, 374.83MB read
Requests/sec:  30417.79
Transfer/sec:      6.24MB