load-test-results/2025-6-08_test_4/20250608_195209_gateway_fast_heavy.txt
Running 1m test @ http://localhost:3000/fast
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.51ms   10.57ms  78.56ms   82.15%
    Req/Sec   668.99    106.79     1.05k    76.16%
  294214 requests in 1.00m, 51.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 96
Requests/sec:   4900.61
Transfer/sec:      0.86MB